link/.spacemacs.d/init.el
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; Automatically generated by emacs & org mode
;; Modifications to .spacemacs.d/init.el will be overwritten at next export
;; To change any settings:
;; 1. Edit the org file
;;    /home/aldrichtr/.dotfiles/org-source/spacemacs/init.org
;;    with the customizations you want
;; 2. tangle - export the file
;; 3. restart/reload emacs
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; Init function
;;   This provides the =dotspacemacs/init()= function, which has several settings
;;   for the overall configuration of spacemacs

;;    Initialization function.  This function is called at the very startup of
;;    Spacemacs initialization before layers configuration.  You should not put any
;;    user code in there besides modifying the variable values

(defun dotspacemacs/init ()
  (message "calling dotspacemacs/init")
  (setq-default dotspacemacs-elpa-https nil)
  (setq-default dotspacemacs-elpa-timeout 5)
  (setq-default dotspacemacs-check-for-update nil)
  (setq-default dotspacemacs-elpa-subdirectory nil)
  (setq-default dotspacemacs-editing-style 'hybrid)
  (setq-default dotspacemacs-verbose-loading nil)
  (setq-default dotspacemacs-startup-banner 'nil)
  (setq-default dotspacemacs-startup-lists '((agenda)
                                             (recents . 5)
                                             (projects . 7)
                                             (bookmarks . 5)))
  (setq-default dotspacemacs-startup-buffer-responsive t)
  (setq-default dotspacemacs-scratch-mode 'org-mode)
  (setq-default dotspacemacs-themes '(hc-zenburn twilight soft-morning))
  (setq-default dotspacemacs-colorize-cursor-according-to-state t)
  (setq-default dotspacemacs-default-font '("Source Code Pro"
                                            :size 14
                                            :weight normal
                                            :width normal
                                            :powerline-scale 1.4))
  (setq-default dotspacemacs-leader-key "SPC")
  (setq-default dotspacemacs-emacs-command-key "SPC")
  (setq-default dotspacemacs-ex-command-key ":")
  (setq-default dotspacemacs-emacs-leader-key "M-m")
  (setq-default dotspacemacs-major-mode-leader-key ",")
  (setq-default dotspacemacs-major-mode-emacs-leader-key "C-M-m")
  (setq-default dotspacemacs-distinguish-gui-tab nil)
  (setq-default dotspacemacs-remap-Y-to-y$ nil)
  (setq-default dotspacemacs-retain-visual-state-on-shift t)
  (setq-default dotspacemacs-visual-line-move-text nil)
  (setq-default dotspacemacs-ex-substitute-global nil)
  (setq-default dotspacemacs-default-layout-name "Default")
  (setq-default dotspacemacs-display-default-layout nil)
  (setq-default dotspacemacs-auto-resume-layouts nil)
  (setq-default dotspacemacs-large-file-size 1)
  (setq-default dotspacemacs-auto-save-file-location 'cache)
  (setq-default dotspacemacs-max-rollback-slots 5)
  (setq-default dotspacemacs-helm-resize nil)
  (setq-default dotspacemacs-helm-no-header nil)
  (setq-default dotspacemacs-helm-position 'bottom)
  (setq-default dotspacemacs-helm-use-fuzzy 'always)
  (setq-default dotspacemacs-enable-paste-transient-state nil)
  (setq-default dotspacemacs-which-key-delay 0.4)
  (setq-default dotspacemacs-which-key-position 'bottom)
  (setq-default dotspacemacs-loading-progress-bar t)
  (setq-default dotspacemacs-fullscreen-at-startup nil)
  (setq-default dotspacemacs-fullscreen-use-non-native nil)
