org-source/spacemacs/init.org
** maximized at startup
   If non nil the frame is maximized when Emacs starts up.
   Takes effect only if `dotspacemacs-fullscreen-at-startup' is nil.
   (default nil) (Emacs 24.4+ only)
   #+BEGIN_SRC emacs-lisp
   (setq-default dotspacemacs-maximized-at-startup nil)
   #+END_SRC

** active transparency
   A value from the range (0..100), in increasing opacity, which describes
   the transparency level of a frame when it's active or selected.
   Transparency can be toggled through `toggle-transparency'. (default 90)
   #+BEGIN_SRC emacs-lisp
   (setq-default dotspacemacs-active-transparency 90)
   #+END_SRC

** inactive transparency
   A value from the range (0..100), in increasing opacity, which describes
   the transparency level of a frame when it's inactive or deselected.
   Transparency can be toggled through `toggle-transparency'. (default 90)
   #+BEGIN_SRC emacs-lisp
   (setq-default dotspacemacs-inactive-transparency 70)
   #+END_SRC

** show transient state title
   If non nil show the titles of transient states. (default t)
   #+BEGIN_SRC emacs-lisp
   (setq-default dotspacemacs-show-transient-state-title t)
   #+END_SRC

** show transient state color guide
   If non nil show the color guide hint for transient state keys. (default t)
   #+BEGIN_SRC emacs-lisp
   (setq-default dotspacemacs-show-transient-state-color-guide t)
   #+END_SRC

** mode line
   If non nil unicode symbols are displayed in the mode line. (default t)
   #+BEGIN_SRC emacs-lisp
   (setq-default dotspacemacs-mode-line-theme 'all-the-icons)
   (setq-default dotspacemacs-mode-line-unicode-symbols t)
   #+END_SRC

** smooth scrolling
   If non nil smooth scrolling (native-scrolling) is enabled. Smooth
   scrolling overrides the default behavior of Emacs which recenters point
   when it reaches the top or bottom of the screen. (default t)
   #+BEGIN_SRC emacs-lisp
   (setq-default dotspacemacs-smooth-scrolling t)
   #+END_SRC

** line numbers
   If non nil line numbers are turned on in all `prog-mode' and `text-mode'
   derivatives. If set to `relative', also turns on relative line numbers.
   (default nil)
   #+BEGIN_SRC emacs-lisp
   (setq-default dotspacemacs-line-numbers t)
   #+END_SRC

** folding method
   Code folding method. Possible values are `evil' and `origami'.
   (default 'evil)
   #+BEGIN_SRC emacs-lisp
   (setq-default dotspacemacs-folding-method 'origami)
   #+END_SRC

** smartparens strict mode
   If non-nil smartparens-strict-mode will be enabled in programming modes.
   (default nil)
   #+BEGIN_SRC emacs-lisp
   (setq-default dotspacemacs-smartparens-strict-mode nil)
   #+END_SRC

** smart closing parenthesis
   If non-nil pressing the closing parenthesis `)' key in insert mode passes
   over any automatically added closing parenthesis, bracket, quote, etc…
   This can be temporary disabled by pressing `C-q' before `)'. (default nil)
   #+BEGIN_SRC emacs-lisp
   (setq-default dotspacemacs-smart-closing-parenthesis t)
   #+END_SRC

** highlight delimiters
   Select a scope to highlight delimiters. Possible values are `any',
   `current', `all' or `nil'. Default is `all' (highlight any scope and
   emphasis the current one). (default 'all)
   #+BEGIN_SRC emacs-lisp
   (setq-default dotspacemacs-highlight-delimiters 'all)
   #+END_SRC

** persistent server
   If non nil, advise quit functions to keep server open when quitting.
   (default nil)
   #+BEGIN_SRC emacs-lisp
   (setq-default dotspacemacs-persistent-server nil)
   #+END_SRC

** search tools
   List of search tool executable names. Spacemacs uses the first installed
   tool of the list. Supported tools are `ag', `pt', `ack' and `grep'.
   (default '("ag" "pt" "ack" "grep"))
   #+BEGIN_SRC emacs-lisp
   (setq-default dotspacemacs-search-tools '("ag" "pt" "ack" "grep"))
   #+END_SRC

** default package repository
   The default package repository used if no explicit repository has been
   specified with an installed package.
   Not used for now. (default nil)
   #+BEGIN_SRC emacs-lisp
   (setq-default dotspacemacs-default-package-repository nil)
   #+END_SRC

** whitespace cleanup
   Delete whitespace while saving buffer. Possible values are `all'
   to aggressively delete empty line and long sequences of whitespace,
   `trailing' to delete only the whitespace at end of lines, `changed'to
   delete only whitespace for changed lines or `nil' to disable cleanup.
   (default nil)
   #+BEGIN_SRC emacs-lisp
   (setq-default dotspacemacs-whitespace-cleanup 'trailing)
   #+END_SRC

** Closing init function
   #+BEGIN_SRC emacs-lisp
   )
   #+END_SRC

* User init function
  This provides the =dotspacemacs/user-init()= function, which can be used to
  set any variables *before* layer configuration.

   Initialization function.  This function is called at the very startup of
   Spacemacs initialization before layers configuration.  You should not put any
   user code in there besides modifying the variable values
  #+BEGIN_SRC emacs-lisp :comments org
    (defun dotspacemacs/user-init ()
    (message "calling dotspacemacs/user-init")
  #+END_SRC
** Set the org-directory prior to running any functions
   #+BEGIN_SRC emacs-lisp
        (setq org-directory "~/org")
   #+END_SRC
** Closing init function
    #+BEGIN_SRC emacs-lisp
    )
    #+END_SRC

* Layers function
  This provides the dotspacemacs/layers() function, which has several lists
  that control the install of layers and packages.

  Open the defun here, but be careful to ensure that it is closed at the bottom.
  Some additional details about layers can be found in
  [[file:~/.emacs.d/layers/LAYERS.org]] also, look at
  [[~/.emacs.d/layers/auto-layer.el]] for how layers are associated to files.

  #+BEGIN_SRC emacs-lisp :comments org
    (defun dotspacemacs/layers ()
    (message "calling dotspacemacs/layers")
  #+END_SRC

** Base distribution
   Base distribution to use. This is a layer contained in the directory
   `+distribution'. For now available distributions are
   - spacemacs-base
   - spacemacs
   (default 'spacemacs)
   #+BEGIN_SRC emacs-lisp
   (setq-default dotspacemacs-distribution 'spacemacs)
   #+END_SRC

** Lazy install
    Lazy installation of layers (i.e. layers are installed only when a file
   with a supported type is opened). Possible values are:
   - all :: lazy install any layer that support lazy installation even the
     layers listed in =dotspacemacs-configuration-layers=
   - unused :: will lazy install only unused layers (i.e. layers  not listed
   in variable =dotspacemacs-configuration-layers= )
   - nil :: disable the lazy installation feature and you have to explicitly
     list a layer in the variable =dotspacemacs-configuration-layers= to install
     it.
   (default 'unused)

   #+BEGIN_SRC emacs-lisp
   (setq-default dotspacemacs-enable-lazy-installation 'unused)
   #+END_SRC

*** ask first
    If non-nil then Spacemacs will ask for confirmation before installing a
    layer lazily. If non-nil layers with lazy install support are lazy
    installed.
    (default t)

    #+BEGIN_SRC emacs-lisp
    (setq-default dotspacemacs-ask-for-lazy-installation t)
    #+END_SRC

** install packages
   Defines the behaviour of Spacemacs when installing packages.
   Possible values are:
   - used-only :: installs only explicitly used packages and uninstall any
     unused packages as well as their unused dependencies.
   - used-but-keep-unused :: installs only the used packages but won't uninstall
     them if they become unused.
   - all :: installs *all* packages supported by Spacemacs and never uninstall
     them.
   (default is `used-only')

   #+BEGIN_SRC emacs-lisp
   (setq-default dotspacemacs-install-packages 'used-only)
   #+END_SRC

** Additional paths
   List of additional paths where to look for configuration layers.
   Paths must have a trailing slash (i.e. `~/.mycontribs/')

   #+BEGIN_SRC emacs-lisp
   (setq-default dotspacemacs-configuration-layer-path '())
   #+END_SRC

** configuration layers
   :PROPERTIES:
   :VISIBILITY: all
   :END:
   List of configuration layers to load.  This is the main way to add
   functionality to spacemacs.  Adding the layer here causes spacemacs to
   install and configure the components.  Look at =~/.emacs.d/layers= for an
   idea of the grouping and naming.

   #+BEGIN_SRC emacs-lisp
   (setq-default dotspacemacs-configuration-layers
   '(
   #+END_SRC

*** Emacs tools
    [[file:~/.emacs.d/layers/+emacs/README.org]]
    These layers add functionality to emacs as an application and or improve on
    base packages such as =org mode=

    #+BEGIN_SRC emacs-lisp
      better-defaults   ;; emacs mode configuration
      semantic          ;; parsers and IDE type functions
      (org               ;; of course
       :variables
       org-enable-github-support t
       )
      outshine          ;; org-mode in comments, and org-mode navigation
      helpful           ;; more detailed help from emacs
      ibuffer           ;; grouping in the buffer list
   #+END_SRC
*** Completions
    [[file:~/.emacs.d/layers/+completion/README.org]]
    These layers add completion functions in programming languages, commands,
    and other functions across emacs

    #+BEGIN_SRC emacs-lisp
      helm              ;; use helm over ivy for emacs functions
      auto-completion   ;; tab completion, snippets
    #+END_SRC

*** Templates
    file:~/.emacs.d/layers/+templates/README.org
    Text automatically inserted in a new file.

    #+BEGIN_SRC emacs-lisp
    templates           ;; use yasnippet to fill in new files
    #+END_SRC

*** Checking
    These layers verify and validate text in the buffer.
    [[file:~/.emacs.d/layers/+checkers/README.org]]

    #+BEGIN_SRC emacs-lisp
    spell-checking    ;; flyspell and supporting packages
    syntax-checking   ;; flycheck and supporting packages
    #+END_SRC

*** Keyboard tools
    [[file:~/.emacs.d/layers/+intl/keyboard-layout/README.org]]

    #+BEGIN_SRC emacs-lisp
      keyboard-layout          ;; help spacemacs do dvorak
    #+END_SRC

*** Programming languages
    [[file:~/emacs.d/layers/+lang]] each language has it's own README.org
    Syntax highlighting, formatting, convenience functions for programming
    languages and file types

    #+BEGIN_SRC emacs-lisp
      c-c++
      emacs-lisp
      shell-scripts
      yaml
      ruby
      lua
      plantuml
      javascript
      html
      latex
      markdown
      python
      windows-scripts
    #+END_SRC

*** Source control
    [[file:~/.emacs.d/layers/+source-control]] Tools have their own README.org
    As the name implies, source control tools such as git, etc.

    #+BEGIN_SRC emacs-lisp
      version-control
      git
      github
    #+END_SRC

*** Tags
    [[file:~/.emacs.d/layers/+tags]] Tools have their own README.org
    Source code tag utilities

    #+BEGIN_SRC emacs-lisp
    cscope
    gtags
    #+END_SRC

*** Coloring text
    [[file:~/.emacs.d/layers/+themes]]
    Themes and color naming

    #+BEGIN_SRC emacs-lisp
      themes-megapack
      colors
    #+END_SRC

*** File trees and dired replacements
    [[file:~/.emacs.d/layers/+filetree/treemacs/README.org]]

    #+BEGIN_SRC emacs-lisp
    treemacs
    #+END_SRC

*** Tools
    [[file:~/.emacs.d/layers/+tools]] A mixed bag of tools for emacs, and tools for
    building things, like compiler integration, etc.
**** Emacs tools

    #+BEGIN_SRC emacs-lisp
      deft
      pdf
      cmake
      meson
    #+END_SRC

**** System tools

    #+BEGIN_SRC emacs-lisp
      ansible
      terraform
      docker
      kubernetes
      xclipboard
    #+END_SRC

