link/.spacemacs.d/init.el
  (setq-default dotspacemacs-maximized-at-startup nil)
  (setq-default dotspacemacs-active-transparency 90)
  (setq-default dotspacemacs-inactive-transparency 70)
  (setq-default dotspacemacs-show-transient-state-title t)
  (setq-default dotspacemacs-show-transient-state-color-guide t)
  (setq-default dotspacemacs-mode-line-theme 'all-the-icons)
  (setq-default dotspacemacs-mode-line-unicode-symbols t)
  (setq-default dotspacemacs-smooth-scrolling t)
  (setq-default dotspacemacs-line-numbers t)
  (setq-default dotspacemacs-folding-method 'origami)
  (setq-default dotspacemacs-smartparens-strict-mode nil)
  (setq-default dotspacemacs-smart-closing-parenthesis t)
  (setq-default dotspacemacs-highlight-delimiters 'all)
  (setq-default dotspacemacs-persistent-server nil)
  (setq-default dotspacemacs-search-tools '("ag" "pt" "ack" "grep"))
  (setq-default dotspacemacs-default-package-repository nil)
  (setq-default dotspacemacs-whitespace-cleanup 'trailing)
  )
;; User init function
;;   This provides the =dotspacemacs/user-init()= function, which can be used to
;;   set any variables *before* layer configuration.

;;    Initialization function.  This function is called at the very startup of
;;    Spacemacs initialization before layers configuration.  You should not put any
;;    user code in there besides modifying the variable values

(defun dotspacemacs/user-init ()
  (message "calling dotspacemacs/user-init")
  (setq org-directory "~/org")
  )
;; Layers function
;;   This provides the dotspacemacs/layers() function, which has several lists
;;   that control the install of layers and packages.

;;   Open the defun here, but be careful to ensure that it is closed at the bottom.
;;   Some additional details about layers can be found in
;;   [[file:~/.emacs.d/layers/LAYERS.org]] also, look at
;;   [[~/.emacs.d/layers/auto-layer.el]] for how layers are associated to files.


(defun dotspacemacs/layers ()
  (message "calling dotspacemacs/layers")
  (setq-default dotspacemacs-distribution 'spacemacs)
  (setq-default dotspacemacs-enable-lazy-installation 'unused)
  (setq-default dotspacemacs-ask-for-lazy-installation t)
  (setq-default dotspacemacs-install-packages 'used-only)
  (setq-default dotspacemacs-configuration-layer-path '())
  (setq-default dotspacemacs-configuration-layers
                '(
                  better-defaults   ;; emacs mode configuration
                  semantic          ;; parsers and IDE type functions
                  (org               ;; of course
                   :variables
                   org-enable-github-support t
                   )
                  outshine          ;; org-mode in comments, and org-mode navigation
                  helpful           ;; more detailed help from emacs
                  ibuffer           ;; grouping in the buffer list
                  helm              ;; use helm over ivy for emacs functions
                  auto-completion   ;; tab completion, snippets
                  templates           ;; use yasnippet to fill in new files
                  spell-checking    ;; flyspell and supporting packages
                  syntax-checking   ;; flycheck and supporting packages
                  keyboard-layout          ;; help spacemacs do dvorak
                  c-c++
                  emacs-lisp
                  shell-scripts
                  yaml
                  ruby
                  lua
                  plantuml
                  javascript
                  html
                  latex
                  markdown
                  python
                  windows-scripts
                  version-control
                  git
                  github
                  cscope
                  gtags
                  themes-megapack
                  colors
                  treemacs
                  deft
                  pdf
                  cmake
                  meson
                  ansible
                  terraform
                  docker
                  kubernetes
                  xclipboard
