org-source/spacemacs/init.org
*** vi emulation - integration
    [[file:~/.emacs.d/layers/+vim]] Using evil mode (making emacs modal like vim,
     it's kinda cool).

    #+BEGIN_SRC emacs-lisp
      evil-commentary
      evil-snipe
    #+END_SRC

*** Closing configuration layers

    #+BEGIN_SRC emacs-lisp
    ))
    #+END_SRC

** additional packages
   List of additional packages that will be installed without being
   wrapped in a layer.  Items here are good candidates for creating a layer.

   #+BEGIN_SRC emacs-lisp
     (setq-default dotspacemacs-additional-packages
     '(
   #+END_SRC

*** Packages

    #+BEGIN_SRC emacs-lisp
      drag-stuff
      move-text
      org-ql
      org-alert
      org-attach-screenshot
      org-sync
      org-onenote
      calfw
      calfw-org
    #+END_SRC

*** Closing additional packages

    #+BEGIN_SRC emacs-lisp
    ))
    #+END_SRC

** frozen packages
   A list of packages that cannot be updated.  If an older version of a package
    is desired, you can freeze the version here

    #+BEGIN_SRC emacs-lisp
    (setq dotspacemacs-frozen-packages '())
    #+END_SRC

** excluded packages
   A list of packages that will not be installed and loaded.

   #+BEGIN_SRC emacs-lisp
   (setq-default dotspacemacs-excluded-packages
    '(
   #+END_SRC

*** Packages

    #+BEGIN_SRC emacs-lisp
      org-projectile
   #+END_SRC

*** Closing excluded packages

   #+BEGIN_SRC emacs-lisp
     ))
   #+END_SRC

** Close the layers function

   #+BEGIN_SRC emacs-lisp
   )
   #+END_SRC

* User config function
  This provides the =dotspacemacs/user-config= function.
  Open the defun here, but be careful to ensure that it is closed at the bottom.

  This function is loaded after the =dotspacemacs/layers= function.  Any custom
  settings for the layer, or the included packages should be done here.

  *note* that [[~/.emacs.d/layers/auto-layer.el]] does some file association for
  layers.

  #+BEGIN_SRC emacs-lisp :comments org
    (defun dotspacemacs/user-config ()
    (message "calling dotspacemacs/user-config")
  #+END_SRC

** Configuration Layers
    I want to keep this hierarchy and the layers hierarchy in sync as much as
   possible.  I think that'll make it easier to keep track of the load, and setup
   of each package.
*** Emacs tools
**** better-defaults
     This package configures some features in spacemacs emacs mode (as opposed to
     the evil mode)
     Ctrl-A and Ctrl-E will move to the beginning/end of the code line, vice the
     text line

     #+BEGIN_SRC emacs-lisp
     (setq  better-defaults-move-to-beginning-of-code-first t
            better-defaults-move-to-end-of-code-first t)
     #+END_SRC

**** ibuffer
     Organize the buffer list

     #+BEGIN_SRC emacs-lisp
     (setq ibuffer-group-buffers-by 'projects)
     #+END_SRC

**** org-mode
     :PROPERTIES:
     :VISIBILITY: children
     :END:
***** eval after load first
      We need to wrap these things so that the newer version of org is loaded first

      #+BEGIN_SRC emacs-lisp
      (with-eval-after-load 'org
      #+END_SRC

***** org modules and exporters
       Org mode is a system with many add-ons and features.  The Export function has
       many more options than what is set as default

       #+BEGIN_SRC emacs-lisp
       (setq org-export-backends
        '(ascii
          beamer
          html
          icalendar
          latex
          md
          odt
          org
          taskjuggler
          )
       )
       #+END_SRC

       Set up color source code blocks in latex

       #+BEGIN_SRC emacs-lisp
         (require 'ox-latex)
         (add-to-list 'org-latex-packages-alist '("" "minted"))
         (setq org-export-latex-listings 'minted)
         (setq org-src-fontify-natively t)
       #+END_SRC

       Enable the following languages for code blocks processing
       #+BEGIN_SRC emacs-lisp
         (org-babel-do-load-languages
          'org-babel-load-languages
          '((emacs-lisp . t)
            (C . t)
            (ditaa . t)
            (plantuml . t)
            (dot . t)
            (latex . t)
            (lua . t)
            (org . t)
            (python . t)
            (ruby . t)
            (shell . t)
            (sqlite . t)
           ))
       #+END_SRC
***** org mode hooks
      things to enable based on the file type

      #+BEGIN_SRC emacs-lisp
      (add-hook 'org-mode-hook 'turn-on-auto-fill)
      (add-hook 'org-mode-hook 'flyspell-mode)
      (add-hook 'org-mode-hook (lambda () (hl-todo-mode -1) nil))
      #+END_SRC

***** org todo

      #+BEGIN_SRC emacs-lisp
        (setq org-todo-keywords '(
                (sequence "TODO(t)" "NEXT(n)" "|" "DONE(d!)" "CANC(c@)")
                (sequence "MEET(m)" "|")
        ))
        (setq org-todo-keyword-faces (quote (
                              ("TODO" :foreground "brown"      :weight bold)
                              ("NEXT" :foreground "tomato"     :weight bold)
                              ("MEET" :foreground "tomato"     :weight bold)
                              ("DONE" :foreground "olive drab" :weight bold)
                              ("CANC" :foreground "olive drab" :weight bold)
        )))
      #+END_SRC

      Ensure that TODOs don't get marked as DONE while child items are open even if
      its checkboxes

      #+BEGIN_SRC emacs-lisp
        (setq org-enforce-todo-dependencies t)
        (setq org-enforce-todo-checkbox-dependencies t)
        (setq org-agenda-dim-blocked-tasks nil)
      #+END_SRC

***** org habits

      #+BEGIN_SRC emacs-lisp
      (setq org-habit-show-habits-only-for-today nil)
      #+END_SRC

***** org effort estimates
      By assigning effort to tasks, i am able to filter out tasks that i dont have
      time to complete right now

      #+BEGIN_SRC emacs-lisp
        (setq org-global-properties
              (quote (
                      ("Effort_ALL" . "0:15 0:30 1:00 2:00 4:00 1d 5d")
                      )))
      #+END_SRC

***** org stuck-projects
      first, a project is loosely defined as an item that is:
      - A TODO item
      - not on the "someday maybe" list
      - not waiting for something else
      - not explicitly set to ignore
      - not in review
      - not scheduled
      Next
      - if it has a TODO item its not stuck (the lower one may be though)
      - if it has a NEXT item its not stuck

      #+BEGIN_SRC emacs-lisp
      (setq org-stuck-projects
      '(
         ;; the tags-todo search that identifies projects
         "-someday-wait-IGNORE-REVIEW/TODO"
         ;; if these TODO words are found, it is not stuck
         ("NEXT")
         ;; if these tags are found in the subitems, it is not stuck
         nil
         ;; a regular expression that matches non stuck
         ""
        )
       )
      #+END_SRC

***** org tags
      Tags are used for two major functions; filtering and searching

      #+BEGIN_SRC emacs-lisp
      ;; Replace org-set-tags with org-set-tags-command in keybinding
      (spacemacs/set-leader-keys-for-major-mode 'org-mode ":" 'org-set-tags-command)
      (setq org-tags-column -120)

      (setq org-tag-alist '(
       ;;   Next Action Contexts
            ("comms"    .   ?c)
            ("web"      .   ?w)
            ("cac"      .   ?a)
            ("office"   .   ?o)
            ("home"     .   ?h)
            ("mcen"     .   ?m)
            ("vault"    .   ?v)
            ("imefdm"   .   ?i)
            ("system"   .   ?s)
       ;;   Meetings and People
            ("staff"    .   ?t)
            ("spe"      .   ?p)
            ("col"      .   ?C)
       ;;   Categories and flags
            ("someday"  .   ?S)
            ("wait"     .   ?W)
            ("read"     .   ?r)
            ("fifo"     .   ?f)
            ("journal"  .   ?j)
            ("REVIEW"   .   ?R)
            ))

        (setq org-tags-exclude-from-inheritance '(
            "read"
            "REVIEW"
            "wait"
            "fifo"
            "journal"
            ))


      #+END_SRC

***** org clock
      #+BEGIN_SRC emacs-lisp
      (org-clock-persistence-insinuate)
      ;; the number of clock tasks to remember in history
      (setq org-clock-history-length 36)
      ;; resume clock when clocking into task with open clock.
      ;; When clocking into a task with a clock entry which has not been closed,
      ;; the clock can be resumed from that point
      (setq org-clock-in-resume t)
      ;; when set to t , both the running clock and entire history are saved when
      ;; emacs closes and resume when emacs restarts
      (setq org-clock-persist t)
      ;; put clock times into LOGBOOK drawer
      (setq org-clock-into-drawer t)
      ;; clock out when the task is marked DONE
      (setq org-clock-out-when-done t)
      ;; set the mode line clock display
      (setq mode-line-org-clock t)
      (setq spaceline-org-clock-p t)
      #+END_SRC

***** org protocol
      Almost the best feature of org mode.  Enabling org-protocol lets me send
      clips to org from the browser

     #+BEGIN_SRC emacs-lisp
       (require 'org-protocol)
    #+END_SRC

