link/.spacemacs.d/init.el
                  evil-commentary
                  evil-snipe
                  ))
  (setq-default dotspacemacs-additional-packages
                '(
                  drag-stuff
                  move-text
                  org-ql
                  org-alert
                  org-attach-screenshot
                  org-sync
                  org-onenote
                  calfw
                  calfw-org
                  ))
  (setq dotspacemacs-frozen-packages '())
  (setq-default dotspacemacs-excluded-packages
                '(
                  org-projectile
                  ))
  )
;; User config function
;;   This provides the =dotspacemacs/user-config= function.
;;   Open the defun here, but be careful to ensure that it is closed at the bottom.

;;   This function is loaded after the =dotspacemacs/layers= function.  Any custom
;;   settings for the layer, or the included packages should be done here.

;;   *note* that [[~/.emacs.d/layers/auto-layer.el]] does some file association for
;;   layers.


(defun dotspacemacs/user-config ()
  (message "calling dotspacemacs/user-config")
  (setq  better-defaults-move-to-beginning-of-code-first t
         better-defaults-move-to-end-of-code-first t)
  (setq ibuffer-group-buffers-by 'projects)
  (with-eval-after-load 'org
    (setq org-export-backends
          '(ascii
            beamer
            html
            icalendar
            latex
            md
            odt
            org
            taskjuggler
            )
          )
    (require 'ox-latex)
    (add-to-list 'org-latex-packages-alist '("" "minted"))
    (setq org-export-latex-listings 'minted)
    (setq org-src-fontify-natively t)
    (org-babel-do-load-languages
     'org-babel-load-languages
     '((emacs-lisp . t)
       (C . t)
       (ditaa . t)
       (plantuml . t)
       (dot . t)
       (latex . t)
       (lua . t)
       (org . t)
       (python . t)
       (ruby . t)
       (shell . t)
       (sqlite . t)
       ))
    (add-hook 'org-mode-hook 'turn-on-auto-fill)
    (add-hook 'org-mode-hook 'flyspell-mode)
    (add-hook 'org-mode-hook (lambda () (hl-todo-mode -1) nil))
    (setq org-todo-keywords '(
                              (sequence "TODO(t)" "NEXT(n)" "|" "DONE(d!)" "CANC(c@)")
                              (sequence "MEET(m)" "|")
                              ))
    (setq org-todo-keyword-faces (quote (
                                         ("TODO" :foreground "brown"      :weight bold)
                                         ("NEXT" :foreground "tomato"     :weight bold)
                                         ("MEET" :foreground "tomato"     :weight bold)
                                         ("DONE" :foreground "olive drab" :weight bold)
                                         ("CANC" :foreground "olive drab" :weight bold)
                                         )))
    (setq org-enforce-todo-dependencies t)
    (setq org-enforce-todo-checkbox-dependencies t)
    (setq org-agenda-dim-blocked-tasks nil)
    (setq org-habit-show-habits-only-for-today nil)
    (setq org-global-properties
          (quote (
                  ("Effort_ALL" . "0:15 0:30 1:00 2:00 4:00 1d 5d")
                  )))
    (setq org-stuck-projects
          '(
            ;; the tags-todo search that identifies projects
            "-someday-wait-IGNORE-REVIEW/TODO"
            ;; if these TODO words are found, it is not stuck
            ("NEXT")
            ;; if these tags are found in the subitems, it is not stuck
            nil
            ;; a regular expression that matches non stuck
            ""
            )
          )
    ;; Replace org-set-tags with org-set-tags-command in keybinding
    (spacemacs/set-leader-keys-for-major-mode 'org-mode ":" 'org-set-tags-command)
    (setq org-tags-column -120)

    (setq org-tag-alist '(
                          ;;   Next Action Contexts
                          ("comms"    .   ?c)
                          ("web"      .   ?w)
                          ("cac"      .   ?a)
                          ("office"   .   ?o)
                          ("home"     .   ?h)
                          ("mcen"     .   ?m)
                          ("vault"    .   ?v)
                          ("imefdm"   .   ?i)
                          ("system"   .   ?s)
                          ;;   Meetings and People
                          ("staff"    .   ?t)
                          ("spe"      .   ?p)
                          ("col"      .   ?C)
                          ;;   Categories and flags
                          ("someday"  .   ?S)
                          ("wait"     .   ?W)
                          ("read"     .   ?r)
                          ("fifo"     .   ?f)
                          ("journal"  .   ?j)
                          ("REVIEW"   .   ?R)
                          ))

    (setq org-tags-exclude-from-inheritance '(
                                              "read"
                                              "REVIEW"
                                              "wait"
                                              "fifo"
                                              "journal"
                                              ))
    (org-clock-persistence-insinuate)
    ;; the number of clock tasks to remember in history
    (setq org-clock-history-length 36)
    ;; resume clock when clocking into task with open clock.
    ;; When clocking into a task with a clock entry which has not been closed,
    ;; the clock can be resumed from that point
    (setq org-clock-in-resume t)
    ;; when set to t , both the running clock and entire history are saved when
    ;; emacs closes and resume when emacs restarts
    (setq org-clock-persist t)
    ;; put clock times into LOGBOOK drawer
    (setq org-clock-into-drawer t)
    ;; clock out when the task is marked DONE
    (setq org-clock-out-when-done t)
    ;; set the mode line clock display
    (setq mode-line-org-clock t)
    (setq spaceline-org-clock-p t)
    (require 'org-protocol)
