org-source/spacemacs/init.org
***** Agenda files
      list of agenda files managed in the org directory.

      This will load all org files in the org directory
      into two lists :
      - First are the files required for the org-agenda
        - this should be =org-agenda-files=
      - The second is the directories used for search such as org-occur
        - this should be =org-agenda-text-search-extra-files=

      Next , because org only makes refile-targets from the
      =org-agenda-files= list we need to adjust that to include
      the Reference folder as well

      #+BEGIN_SRC emacs-lisp
        ; set the default directory for some org functionality

        (setq org-default-inbox-file (f-join org-directory "pim-inbox.org"))
        (setq org-default-journal-file (f-join org-directory "jrn-tasks-ideas-notes-and-brainstorming.org"))
      #+END_SRC

   I updated the way i organize org info using file names. There are several
   components:
   : meta-sphere-project-uniquename-[version].org
   : |    |      |       |          |
   : |    |      |       |          %Y-%m-%d
   : |    |      |       any words that make this searchable
   : |    |      10 to 20 character project or subject
   : |    Six letter area of focus
   : Three letter metatype
   - sphere
     - dseo
     - home
     - fmly
     - ernd
     - hoby
     - self
     - sprt
     - hlth
     - prof
     - task
     - admn
     - code
   - project
     - no format or convention.  Use this to "bucket" projects together, similar
       to how you do "ops" vs "documentation" in dseo currently.  Maybe project
       isn't the same here as it is in GTD or even in your current planner, it's
       more like "initiative" or "goal".
   - uniquename
     - here is where you can get crazy.  Think about the grep you will do later.
   - version
     - the only thing I can think of right now that would use this is the
       journal files.  org archive function handles all of this nicely already,
       with the dates /in/ the entries rather than the filename.

   #+BEGIN_SRC emacs-lisp
   (defvar tra:org-file-metatypes
     '(("reference" . "^ref[a-zA-Z0-9-_]*\\.org$") ; Reference information
       ("document"  . "^doc[a-zA-Z0-9-_]*\\.org$") ; Document production
       ("blogpost"  . "^pst[a-zA-Z0-9-_]*\\.org$") ; Source document for blog
       ("project"   . "^prj[a-zA-Z0-9-_]*\\.org$") ; Project information
       ("journal"   . "^jrn[a-zA-Z0-9-_]*\\.org$") ; Journal entries
       ("planner"   . "^pim[a-zA-Z0-9-_]*\\.org$") ; Personal information management
       ("tickets"   . "^tkt[a-zA-Z0-9-_]*\\.org$") ; Issue tracking
        ))
   (defvar tra:actionable-metatypes '("project" "journal" "planner"))
   (defvar tra:non-actionable-metatypes '("reference" "document" "blogpost"))

   #+END_SRC
   Sphere of life AKA area of focus
   #+BEGIN_SRC emacs-lisp
   (defvar tra:org-file-spheres
     '((work . "dseo")  ; Data Systems Engineering Officer at IMEF
      ))
   #+END_SRC

