link/.spacemacs.d/init.el
                                        ; set the default directory for some org functionality

    (setq org-default-inbox-file (f-join org-directory "pim-inbox.org"))
    (setq org-default-journal-file (f-join org-directory "jrn-tasks-ideas-notes-and-brainstorming.org"))
    (defvar tra:org-file-metatypes
      '(("reference" . "^ref[a-zA-Z0-9-_]*\\.org$") ; Reference information
        ("document"  . "^doc[a-zA-Z0-9-_]*\\.org$") ; Document production
        ("blogpost"  . "^pst[a-zA-Z0-9-_]*\\.org$") ; Source document for blog
        ("project"   . "^prj[a-zA-Z0-9-_]*\\.org$") ; Project information
        ("journal"   . "^jrn[a-zA-Z0-9-_]*\\.org$") ; Journal entries
        ("planner"   . "^pim[a-zA-Z0-9-_]*\\.org$") ; Personal information management
        ("tickets"   . "^tkt[a-zA-Z0-9-_]*\\.org$") ; Issue tracking
        ))
    (defvar tra:actionable-metatypes '("project" "journal" "planner"))
    (defvar tra:non-actionable-metatypes '("reference" "document" "blogpost"))
    (defvar tra:org-file-spheres
      '((work . "dseo")  ; Data Systems Engineering Officer at IMEF
        ))
