link/.spacemacs.d/init.el
    (setq org-agenda-skip-scheduled-if-done 't)
    (setq org-log-into-drawer 't)
    (setq org-agenda-leading-zero 't)
    (setq org-agenda-custom-commands '())
    (setq org-tags-list-match-sublevels 'indented)
    (add-to-list 'org-agenda-custom-commands
                 '("K" "Stuck Projects"
                   ((org-ql-block '(and
                                    (todo "TODO")
                                    (not (tags "wait" "someday" "calendar"))
                                    (not (scheduled))
                                    (children ( todo "DONE" "CANC"))
                                    (not (children (todo "NEXT")))
                                    (not (children (todo "TODO")))
                                    (not (children (scheduled)))
                                    )
                                  ((org-ql-block-header "Potential close - A TODO with only DONE tasks"))
                                  )
                    (org-ql-block '(and
                                    (todo "TODO")
                                    (not (tags "wait" "someday" "calendar"))
                                    (not (scheduled))
                                    (or
                                     (children (todo "TODO"))
                                     (children (todo "DONE" "CANC"))
                                     )
                                    (not (descendants (todo "NEXT")))
                                    (not (children (scheduled)))
                                    )
                                  ((org-ql-block-header "Needs Actions Defined - A TODO with only TODO or DONE tasks"))
                                  )
                    (org-ql-block '(and
                                    (todo "DONE" "CANC")
                                    (not (tags "wait" "someday" "calendar"))
                                    (not (scheduled))
                                    (or
                                     (children (todo "TODO"))
                                     (children (todo "NEXT"))
                                     )
                                    (not (children (scheduled)))
                                    )
                                  ((org-ql-block-header "Missed Actions - A DONE with active TODO or NEXT"))
                                  )
                    (org-ql-block '(and
                                    (todo "NEXT")
                                    (not (tags "wait" "someday" "calendar"))
                                    (not (scheduled))
                                    (children (todo))
                                    )
                                  ((org-ql-block-header "Mislabled Actions - A NEXT with children"))
                                  )
                    )
                   )
                 )
    (add-to-list 'org-agenda-custom-commands
                 '("p" "The Project List"
                   ((org-ql-block '(and
                                    (todo "TODO")
                                    (not (tags "wait" "someday"))
                                    (not (scheduled))
                                    (children (todo "NEXT"))
                                    )
                                  ((org-ql-block-header "The Project List"))
                                  )
                    )
                   (
                    (org-agenda-with-colors t)
                    (org-agenda-remove-tags t)
                    (ps-print-color-p 'black-white)
                    (ps-paper-type 'letter)
                    (ps-top-margin 3)
                    (ps-bottom-margin 3)
                    (ps-left-margin 3)
                    (ps-right-margin 3)
                    (ps-font-size 8.0)
                    (ps-print-header nil)
                    (ps-landscape-mode t)
                    (ps-number-of-columns 2)
                    )
                   ( "~/paperPlanner/Agenda-Export/Page-03.TheProjectList.txt"
                     "~/paperPlanner/Agenda-Export/Page-03.TheProjectList.ps")
                   )
                 )
    (add-to-list 'org-agenda-custom-commands
                 '("v" "Vertical view of a project"
                   ((tags-todo "-someday-WAIT/!")
                    )
                   (
                    (org-agenda-with-colors t)
                    (org-tags-match-list-sublevels 'indented)
                    )
                   ("~/paperPlanner/Agenda-Export/Page-04.Vertical-ProjectView.ps")
                   )
                 )
    (add-to-list 'org-agenda-custom-commands
                 '("Na" "Next Actions"
                   ((org-ql-block '(and
                                    (todo "NEXT")
                                    (tags "comms")
                                    (not (tags "wait" "someday"))
                                    (not (scheduled))
                                    )
                                  ((org-ql-block-header "Communications"))
                                  )
                    (org-ql-block '(and
                                    (todo "NEXT")
                                    (tags "web")
                                    (not (tags "wait" "someday"))
                                    (not (scheduled))
                                    )
                                  ((org-ql-block-header "Web"))
                                  )
                    (org-ql-block '(and
                                    (todo "NEXT")
                                    (tags "cac")
                                    (not (tags "wait" "someday"))
                                    (not (scheduled))
                                    )
                                  ((org-ql-block-header "DoD Websites"))
                                  )
                    (org-ql-block '(and
                                    (todo "NEXT")
                                    (tags "imefdm")
                                    (not (tags "wait" "someday"))
                                    (not (scheduled))
                                    )
                                  ((org-ql-block-header "Tactical Network"))
                                  )
                    (org-ql-block '(and
                                    (todo "NEXT")
                                    (tags "mcen")
                                    (not (tags "wait" "someday"))
                                    (not (scheduled))
                                    )
                                  ((org-ql-block-header "MCEN"))
                                  )
                    (org-ql-block '(and
                                    (todo "NEXT")
                                    (tags "laptop")
                                    (not (tags "wait" "someday"))
                                    (not (scheduled))
                                    )
                                  ((org-ql-block-header "Laptop (system)"))
                                  )
                    (org-ql-block '(and
                                    (todo "NEXT")
                                    (tags "home")
                                    (not (tags "wait" "someday"))
                                    (not (scheduled))
                                    )
                                  ((org-ql-block-header "At Home"))
                                  )
                    (org-ql-block '(and
                                    (todo "NEXT")
                                    (tags "office")
                                    (not (tags "wait" "someday"))
                                    (not (scheduled))
                                    )
                                  ((org-ql-block-header "At the Office"))
                                  )
                    (org-ql-block '(and
                                    (todo "NEXT")
                                    (tags "spe")
                                    (not (tags "wait" "someday"))
                                    (not (scheduled))
                                    )
                                  ((org-ql-block-header "The SPE Roundtable"))
                                  )
                    (org-ql-block '(and
                                    (todo "NEXT")
                                    (not (tags "comm" "web" "cac" "imefdm" "mcen"
                                               "laptop" "spe" "home" "office" "wait" "someday"))
                                    (not (scheduled))
                                    )
                                  ((org-ql-block-header "Uncategorized Next Actions"))
                                  )
                    )))
    (add-to-list 'org-agenda-custom-commands
                 '("Np" "Potential Next Actions"
                   ((org-ql-block '(and
                                    (todo "TODO")
                                    (not (tags "someday" "calendar"))
                                    (not (scheduled))
                                    (not (children (todo)))
                                    )
                                  ((org-ql-block-header "Potential Next Actions"))
                                  )
                    )
                   ))
    (add-to-list 'org-agenda-custom-commands
                 '("Ne" "Next actions by Effort"
                   ((org-ql-block '(and
                                    (todo "NEXT")
                                    (not (tags "someday" "calendar"))
                                    (not (scheduled))
                                    (property "Effort" "0:15")
                                    )
                                  ((org-ql-block-header "15 Min Next actions"))
                                  )

                    (org-ql-block '(and
                                    (todo "NEXT")
                                    (not (tags "someday" "calendar"))
                                    (not (scheduled))
                                    (property "Effort" "0:30")
                                    )
                                  ((org-ql-block-header "30 Min Next actions"))
                                  )
                    (org-ql-block '(and
                                    (todo "NEXT")
                                    (not (tags "someday" "calendar"))
                                    (not (scheduled))
                                    (property "Effort" "1:00")
                                    )
                                  ((org-ql-block-header "One hour Next actions"))
                                  )
                    (org-ql-block '(and
                                    (todo "NEXT")
                                    (not (tags "someday" "calendar"))
                                    (not (scheduled))
                                    (or
                                     (property "Effort" "2:00")
                                     (property "Effort" "4:00")
                                     )
                                    )
                                  ((org-ql-block-header "Long Next actions"))
                                  )
                    (org-ql-block '(and
                                    (todo "NEXT")
                                    (not (tags "someday" "calendar"))
                                    (not (scheduled))
                                    (not (property "Effort"))
                                    )
                                  ((org-ql-block-header "Next actions with no Effort Assigned"))
                                  )
                    ))
                 )
    (add-to-list 'org-agenda-custom-commands
                 '("Nt" "Time Management"
                   ((org-ql-block '(and
                                    (todo "NEXT")
                                    (not (tags "someday" "calendar"))
                                    (not (scheduled))
                                    (not (children (todo)))
                                    )
                                  ((org-ql-block-header "Time Management"))
                                  )
                    )
                   ((org-agenda-overriding-columns-format "%5TODO %4Effort %4Clocksum %70ITEM(Next Action) %10TAGS")
                    (org-agenda-view-columns-initially t))
                   ))
    (add-to-list 'org-agenda-custom-commands
                 '("w" "Waiting For"
                   ((org-ql-block '(and
                                    (tags "wait")
                                    (not (tags "someday"))
                                    (not (scheduled))
                                    )
                                  ((org-ql-block-header "Waiting For"))
                                  )
                    )
                   ))
    (add-to-list 'org-agenda-custom-commands
                 '("Rb" "Brief Review"
                   ((org-ql-block '(and
                                    (tags "REVIEW")
                                    )
                                  )
                    )
                   )
                 )
    (add-to-list 'org-agenda-custom-commands
                 '("Rd" "Detailed Review"
                   ((org-ql-block '(and
                                    (todo)
                                    (not (tags "someday"))
                                    (not (scheduled))
                                    (tags "REVIEW")
                                    )
                                  ((org-ql-block-header "Tasks marked for Review"))
                                  )
                    (org-ql-block '(and
                                    (not (todo))
                                    (not (todo "DONE"))
                                    (not (tags "someday"))
                                    (not (scheduled))
                                    (tags "REVIEW")
                                    )
                                  ((org-ql-block-header "Items marked for Review"))
                                  )
                    (org-ql-block '(deadline :from today :to 7)
                                  ((org-ql-block-header "Upcoming deadlines this week"))
                                  )

                    (org-ql-block '(scheduled :from today :to 7)
                                  ((org-ql-block-header "Tasks scheduled for this week"))
                                  )

                    (org-ql-block '(clocked :from -7)
                                  ((org-ql-block-header "Tasks worked on last week"))
                                  )
                    )
                   )
                 )
    (add-to-list 'org-agenda-custom-commands
                 '("Rs" "Items that need to be synced with paper"
                   ((org-ql-block '(and
                                    (todo "TODO")
                                    (children (todo "NEXT"))
                                    (not (tags "pp" "someday"))
                                    )
                                  ((org-ql-block-header "Project List Items"))
                                  )
                    (org-ql-block '(and
                                    (todo "NEXT")
                                    (not (tags "pp" "someday"))
                                    )
                                  ((org-ql-block-header "Next Actions"))
                                  )
                    (org-ql-block '(and
                                    (or
                                     (scheduled :from today :to 7)
                                     (deadline :from today :to 7)
                                     (ts-active :from today :to 28)
                                     )
                                    (not (tags "pp"))
                                    )
                                  ((org-ql-block-header "calendar items"))
                                  )
                    )
                   )
                 )
    (setq org-agenda-time-grid (quote
                                ((daily today remove-match)
                                 (0600 0630 0700 0730 0800 0830 0900 0930 1000 1030
                                       1100 1130 1200 1230 1300 1330 1400 1430 1500 1530
                                       1600 1630 1700 1730 1800 1830 1900 1930 2000 2030)
                                 "......" "----------------")))
