org-source/spacemacs/init.org
***** archive settings
      I organized all of the archived org items under a date tree, but
      preserve the original file name.  This marks things as done as they are
      archived if not already.

      #+BEGIN_SRC emacs-lisp
      (setq org-archive-location "~/org/.archive/%s_archive::datetree/")
      (setq org-archive-save-context-info '(time file olpath category todo itags))
      (setq org-archive-mark-done t)
      #+END_SRC

***** Publish projects
      Setup the initial alist so that downstream SRC blocks can add to

      #+BEGIN_SRC emacs-lisp
      (setq org-publish-project-alist '())
      #+END_SRC

      org-info is a javascript "plugin" for html exported org files that adds
      several "nice" features for navigating
      #+BEGIN_SRC emacs-lisp
        (add-to-list 'org-publish-project-alist
                     '("org-info"
                       :base-directory "/home/aldrichtr/org/org-info/"
                       :base-extension "js"
                       :publishing-directory "/var/www/www.timforge.local/htdocs/styles"
                       :publishing-function org-publish-attachment
                       )
                     )
      #+END_SRC

      Any style sheets that I've created

      #+BEGIN_SRC emacs-lisp
        (add-to-list 'org-publish-project-alist
                     '("styles"
                      :base-directory "/home/aldrichtr/org/styles/"
                      :base-extension "css"
                      :publishing-directory "/var/www/www.timforge.local/htdocs/styles"
                      :publishing-function org-publish-attachment
                      )
                     )
      #+END_SRC

      #+BEGIN_SRC emacs-lisp
        (add-to-list 'org-publish-project-alist
                     '("org files"
                       :base-directory "/home/aldrichtr/org/"
                       :base-extension "org"
                       :publishing-directory "/var/www/www.timforge.local/htdocs"
                       :recursive t
                       :makeindex t
                       :auto-sitemap t
                       :sitemap-filename "default.org"
                       :publishing-function org-html-publish-to-html
                       )
                     )
      #+END_SRC

***** capture templates
      As the name suggests, these are the templates for information used in the
      capture functionality.

      First, we want to clear the list of any defaults.
      #+BEGIN_SRC emacs-lisp
      (setq org-capture-templates '())
      #+END_SRC

****** Note entry
       This is probably my most used template, it adds an entry to the
       review.org file.  Very basic
      #+BEGIN_SRC emacs-lisp
      (add-to-list 'org-capture-templates
         '("o" "Note" entry
                       (file org-default-inbox-file )
                       "* %? "
                       :kill-buffer t)
      )
      #+END_SRC

****** Web clipping
       This grabs the info from org-protocol capture function, which is called
       by the capture shortcut in firefox.  The information you can grab from
       the page is:
       |%:description | %^{TITLE} | title of the web-page |
       |%:link        | %c        | URL                   |
       |%:initial     | %i        | selected text         |

       #+BEGIN_SRC emacs-lisp
         (add-to-list 'org-capture-templates
         '("w" "Web clipping" entry
           (file org-default-inbox-file)
           "* %:description%? :web:\n  %:initial\n  Source :\n %:link"
           :immediate-finish t
           )
         )
       #+END_SRC

      This one does the same as 'w' but also lets me add a note before saving.
      #+BEGIN_SRC emacs-lisp
      (add-to-list 'org-capture-templates
       '("W" "capture web clip with note" entry
                       (file org-default-inbox-file )
                       "* %:description%? :web:\n  %:initial\n  Source :\n %:link"
                       )
      )
      #+END_SRC
****** Journal entry
       I like this one, it let's me just dump whatever I'm thinking about
       without having to worry that I'll need to refile it later.  Maybe I will,
       maybe I won't ... it's just a journal entry right now.
       #+BEGIN_SRC emacs-lisp
         (add-to-list 'org-capture-templates
                      '("j" "Journal entry" entry
              (file org-default-journal-file )
              "\n* %<%Y-%m-%d> %? :journal: \n %u"
              :prepend t
              :clock-in t
              :clock-resume t)
           )
       #+END_SRC
****** todo item
       A specialization of the basic note entry, I use this one to throw a todo
       into the review file from the command line.  It has an associated
       function to make that work.
       #+BEGIN_SRC emacs-lisp
         (add-to-list 'org-capture-templates
          '( "t" "Add a todo item and close" entry
            (file org-default-inbox-file)
            "* TODO %i\n  %U\n"
            :immediate-finish t
            :kill-buffer t)
         )
       #+END_SRC

***** Turn on alerts based on the agenda schedule

      #+BEGIN_SRC emacs-lisp
      ;; the appointment notification facility
      (setq
        appt-message-warning-time 15 ;; warn 15 min in advance
        appt-display-mode-line t     ;; show in the modeline
        appt-display-format 'window) ;; use our func
      (appt-activate 1)              ;; active appt (appointment notification)
      (display-time)                 ;; time display is required for this...

      ;; update appt:
      ;; - when starting emacs
      (org-agenda-to-appt)
      ;; - each time agenda opened
      (add-hook 'org-finalize-agenda-hook 'org-agenda-to-appt)
      ;;
      (run-at-time "12:05am" (* 24 3600) 'org-agenda-to-appt)
      #+END_SRC

      #+BEGIN_SRC emacs-lisp
        (require 'org-alert)
        (setq alert-default-style 'libnotify)
        (org-alert-enable)
      #+END_SRC

***** Export to task juggler

      #+BEGIN_SRC emacs-lisp
        (require 'ox-taskjuggler)
        (setq org-taskjuggler-project-tag "tjp")
        (setq org-taskjuggler-reports-directory "~/org/reports")
      #+END_SRC

      Modify the default report to provide a more reasonable report.

      #+BEGIN_SRC emacs-lisp
      (setq org-taskjuggler-default-project-duration 980)
      (setq org-taskjuggler-default-reports
        '("textreport report \"Plan\" {
        formats html
        header '== <-query attribute=\"name\"-> =='

        center -8<-
          [#Plan Plan] | [#Resource_Allocation Resource Allocation]
          ----
          === Plan ===
          <[report id=\"plan\"]>
          ----
          === Resource Allocation ===
          <[report id=\"resourceGraph\"]>
        ->8-
      }

      # A traditional Gantt chart with a project overview.
      taskreport plan \"\" {
        headline \"Project Plan\"
        columns bsi, name, complete, start, end, effort, chart
      # rollup completed tasks
      #  rolluptask plan.end < ${now}
        loadunit shortauto
        hideresource 1
      }

      # A graph showing resource allocation. It identifies whether each
      # resource is under- or over-allocated for.
      resourcereport resourceGraph \"\" {
        headline \"Resource Allocation Graph\"
        columns no, name, effort, weekly
        loadunit shortauto
        hidetask ~(isleaf() & isleaf_())
        sorttasks plan.start.up
      }"))
      #+END_SRC

***** Org-sync issue-tracking system sync
      #+BEGIN_SRC emacs-lisp
      (require 'org-sync-github)
      #+END_SRC

***** close eval

      #+BEGIN_SRC emacs-lisp
      )
      #+END_SRC

***** elgantt
      this is an external git repo with a very interesting tool.  Its an
      interactive gantt view of your agenda

      #+BEGIN_SRC emacs-lisp
        (add-to-list 'load-path "~/.spacemacs.d/external/elgantt/")
        (require 'elgantt)
        (setq elgantt-timestamps-to-display '(deadline timestamp scheduled timestamp-range))
        (setq elgantt-draw-overarching-headers 't)
      #+END_SRC

*** Completions
**** yasnippet
     An amazing snippet utility.

     #+BEGIN_SRC emacs-lisp
     (setq yas-snippet-dirs
         '("~/.spacemacs.d/snippets"))
     (yas-global-mode 1)
     (setq auto-completion-enable-snippets-in-popup t)
     (setq auto-completion-enable-sort-by-usage t)
     (global-company-mode)
     #+END_SRC

*** Templates
    Insert yasnippets into new files

    #+BEGIN_SRC emacs-lisp
    (setq templates-private-directory "~/.spacemacs.d/templates/")
    #+END_SRC

*** Checking
    flycheck and flyspell
*** Keyboard tools
    Tell spacemacs that I want to use the dvorak layout, so modify some of the
    keys (mostly vi-style keys)

    #+BEGIN_SRC emacs-lisp
      (setq kl-layout 'dvorak
        kl-disabled-configurations '(
           helm
           org
           magit
           twittering-mode))
    #+END_SRC

*** Programming languages
