link/.spacemacs.d/init.el
    (setq org-archive-location "~/org/.archive/%s_archive::datetree/")
    (setq org-archive-save-context-info '(time file olpath category todo itags))
    (setq org-archive-mark-done t)
    (setq org-publish-project-alist '())
    (add-to-list 'org-publish-project-alist
                 '("org-info"
                   :base-directory "/home/aldrichtr/org/org-info/"
                   :base-extension "js"
                   :publishing-directory "/var/www/www.timforge.local/htdocs/styles"
                   :publishing-function org-publish-attachment
                   )
                 )
    (add-to-list 'org-publish-project-alist
                 '("styles"
                   :base-directory "/home/aldrichtr/org/styles/"
                   :base-extension "css"
                   :publishing-directory "/var/www/www.timforge.local/htdocs/styles"
                   :publishing-function org-publish-attachment
                   )
                 )
    (add-to-list 'org-publish-project-alist
                 '("org files"
                   :base-directory "/home/aldrichtr/org/"
                   :base-extension "org"
                   :publishing-directory "/var/www/www.timforge.local/htdocs"
                   :recursive t
                   :makeindex t
                   :auto-sitemap t
                   :sitemap-filename "default.org"
                   :publishing-function org-html-publish-to-html
                   )
                 )
    (setq org-capture-templates '())
    (add-to-list 'org-capture-templates
                 '("o" "Note" entry
                   (file org-default-inbox-file )
                   "* %? "
                   :kill-buffer t)
                 )
    (add-to-list 'org-capture-templates
                 '("w" "Web clipping" entry
                   (file org-default-inbox-file)
                   "* %:description%? :web:\n  %:initial\n  Source :\n %:link"
                   :immediate-finish t
                   )
                 )
    (add-to-list 'org-capture-templates
                 '("W" "capture web clip with note" entry
                   (file org-default-inbox-file )
                   "* %:description%? :web:\n  %:initial\n  Source :\n %:link"
                   )
                 )
    (add-to-list 'org-capture-templates
                 '("j" "Journal entry" entry
                   (file org-default-journal-file )
                   "\n* %<%Y-%m-%d> %? :journal: \n %u"
                   :prepend t
                   :clock-in t
                   :clock-resume t)
                 )
    (add-to-list 'org-capture-templates
                 '( "t" "Add a todo item and close" entry
                    (file org-default-inbox-file)
                    "* TODO %i\n  %U\n"
                    :immediate-finish t
                    :kill-buffer t)
                 )
    ;; the appointment notification facility
    (setq
     appt-message-warning-time 15 ;; warn 15 min in advance
     appt-display-mode-line t     ;; show in the modeline
     appt-display-format 'window) ;; use our func
    (appt-activate 1)              ;; active appt (appointment notification)
    (display-time)                 ;; time display is required for this...

    ;; update appt:
    ;; - when starting emacs
    (org-agenda-to-appt)
    ;; - each time agenda opened
    (add-hook 'org-finalize-agenda-hook 'org-agenda-to-appt)
    ;;
    (run-at-time "12:05am" (* 24 3600) 'org-agenda-to-appt)
    (require 'org-alert)
    (setq alert-default-style 'libnotify)
    (org-alert-enable)
    (require 'ox-taskjuggler)
    (setq org-taskjuggler-project-tag "tjp")
    (setq org-taskjuggler-reports-directory "~/org/reports")
    (setq org-taskjuggler-default-project-duration 980)
    (setq org-taskjuggler-default-reports
          '("textreport report \"Plan\" {
  formats html
  header '== <-query attribute=\"name\"-> =='

  center -8<-
    [#Plan Plan] | [#Resource_Allocation Resource Allocation]
    ----
    === Plan ===
    <[report id=\"plan\"]>
    ----
    === Resource Allocation ===
    <[report id=\"resourceGraph\"]>
  ->8-
}

# A traditional Gantt chart with a project overview.
taskreport plan \"\" {
  headline \"Project Plan\"
  columns bsi, name, complete, start, end, effort, chart
# rollup completed tasks
#  rolluptask plan.end < ${now}
  loadunit shortauto
  hideresource 1
}

# A graph showing resource allocation. It identifies whether each
# resource is under- or over-allocated for.
resourcereport resourceGraph \"\" {
  headline \"Resource Allocation Graph\"
  columns no, name, effort, weekly
  loadunit shortauto
  hidetask ~(isleaf() & isleaf_())
  sorttasks plan.start.up
}"))
    (require 'org-sync-github)
    )
  (add-to-list 'load-path "~/.spacemacs.d/external/elgantt/")
  (require 'elgantt)
  (setq elgantt-timestamps-to-display '(deadline timestamp scheduled timestamp-range))
  (setq elgantt-draw-overarching-headers 't)
  (setq yas-snippet-dirs
        '("~/.spacemacs.d/snippets"))
  (yas-global-mode 1)
  (setq auto-completion-enable-snippets-in-popup t)
  (setq auto-completion-enable-sort-by-usage t)
  (global-company-mode)
  (setq templates-private-directory "~/.spacemacs.d/templates/")
  (setq kl-layout 'dvorak
        kl-disabled-configurations '(
                                     helm
                                     org
                                     magit
                                     twittering-mode))
