org-source/spacemacs/init.org
**** c-c++
    the following section sets up my preferred formatting style

    #+BEGIN_SRC emacs-lisp
    (setq c-basic-offset 4)
    (defconst my-c-style
      '((c-tab-always-indent        . t)
        (c-comment-only-line-offset . 0)
        (c-hanging-braces-alist     . ((substatement-open after)
                                       (brace-list-open)))
        (c-hanging-colons-alist     . ((member-init-intro before)
                                       (inher-intro)
                                       (case-label after)
                                       (label after)
                                       (access-label after)))
        (c-cleanup-list             . (scope-operator
                                       empty-defun-braces
                                       defun-close-semi))
        (c-offsets-alist            . ((arglist-close . c-lineup-arglist)
                                       (substatement-open . 0)
                                       (case-label        . 4)
                                       (block-open        . 0)
                                       (namespace-open    . 0)
                                       (innamespace       . 0)
                                       (knr-argdecl-intro . -)))
        (c-echo-syntactic-information-p . t)
        )
        "My C Programming Style")

     ;; offset customizations not in my-c-style
     (setq c-offsets-alist '((member-init-intro . ++)))

     ;; Customizations for all modes in CC Mode.
     (defun my-c-mode-common-hook ()
      ;; add my personal style and set it for the current buffer
      (c-add-style "PERSONAL" my-c-style t)
      ;; other customizations
      (setq tab-width 4
            ;; this will make sure spaces are used instead of tabs
            indent-tabs-mode nil)
      ;; we like auto-newline and hungry-delete
        (c-toggle-auto-hungry-state 1)
      )
    (add-hook 'c-mode-common-hook 'my-c-mode-common-hook)
    (add-hook 'c++-mode-hook 'my-c-mode-common-hook)
    #+END_SRC

**** Plantuml
     plantuml is a java applet that can convert text into a UML diagram

     #+BEGIN_SRC emacs-lisp
     (setq org-plantuml-jar-path "/usr/share/plantuml/plantuml.jar")
     #+END_SRC

*** Source control
*** Tags
*** Coloring text
*** File trees and dired replacements
**** treemacs

     #+BEGIN_SRC emacs-lisp
       (setq treemacs-use-follow-mode 'tag
       treemacs-use-filewatch-mode t
       treemacs-use-git-mode 'deferred
       treemacs-use-all-the-icons-theme t)
     #+END_SRC

*** Tools
**** deft

     #+BEGIN_SRC emacs-lisp
       (setq deft-use-filename-as-title t)
       ;; with this tell deft to use the search
       ;; term as the filename if a new file is created
       (setq deft-use-filter-string-for-filename t)
       (setq deft-file-naming-rules
             '((noslash . "-")
               (nospace . "-")
               (case-fn . downcase)))
       (setq deft-text-mode 'org-mode)
       (setq deft-org-mode-title-prefix t)
       (setq deft-directory org-directory)
       (setq deft-archive-directory "../.archive/")
       (setq deft-extensions '("org"))
       (setq deft-default-extension "org")
       (setq deft-auto-save-interval 30)
     #+END_SRC

*** vi emulation
** Additional packages
   These elpa packages don't have a spacemacs layer associated with them yet.
*** calfw

    #+BEGIN_SRC emacs-lisp
    (require 'calfw)
    (require 'calfw-org)
    (setq calendar-week-start-day 1) ;; monday
    #+END_SRC

** Remind files
   a syntax highlighting library for remind files

   #+BEGIN_SRC emacs-lisp
   (add-to-list 'load-path "~/.spacemacs.d/external/remind-mode.el")
   (add-to-list 'auto-mode-alist '("\\.rem\\'" . remind-mode))
   #+END_SRC

** Custom keybindings
   A spacemacs convention for user keybindings is under =space o=

*** These are global
   #+BEGIN_SRC emacs-lisp
   (spacemacs/declare-prefix "o" "custom")
   (spacemacs/set-leader-keys "og" 'gtd)
   (spacemacs/set-leader-keys "od" 'deft)
   #+END_SRC
*** mode specific
   any mode specific key bindings are under the 'o' submenu

   #+BEGIN_SRC emacs-lisp
     (spacemacs/declare-prefix-for-mode 'org-mode "mo" "custom")
     (spacemacs/set-leader-keys-for-major-mode 'org-mode "oi" 'org-id-get-create)
     (spacemacs/set-leader-keys-for-major-mode 'org-mode "ort" 'tra:refile-actionable-items)
     (spacemacs/set-leader-keys-for-major-mode 'org-mode "orr" 'tra:refile-reference-items)
     (spacemacs/set-leader-keys-for-major-mode 'org-mode "ors" 'tra:refile-reference-items)
   #+END_SRC
** Run final user setup commands
   Build the agenda files now that everything is setup
   #+BEGIN_SRC emacs-lisp
   (rebuild-agenda-files)
   #+END_SRC
** close user-config function
    #+BEGIN_SRC emacs-lisp
    )
    #+END_SRC
* User functions
  Any custom functions (or advice to functions) get added after all the
  spacemacs initialization is done.
** review
   Simple function to open the review file.

   #+BEGIN_SRC emacs-lisp
   (defun review ()
     (interactive)
     (find-file org-default-inbox-file)
    )
   #+END_SRC

** gtd
   convenience function to open the main org file

   #+BEGIN_SRC emacs-lisp
   (defun gtd ()
   (interactive)
   (find-file org-default-inbox-file)
   )
   #+END_SRC

** Agenda files
   a wrapper function that finds files based on the metatypes
   #+BEGIN_SRC emacs-lisp
     (defun tra:get-metatype-org-files (metatype &optional other-directory)
      (let ((my-org-directory (or other-directory org-directory "~/org")))
        (f-files my-org-directory (lambda (file)
                   (s-matches?
                    (cdr (assoc metatype tra:org-file-metatypes)) (f-filename file) )
        ))))
   #+END_SRC


   #+BEGIN_SRC emacs-lisp
     (defun tra:build-org-agenda-files ()
        (setq org-agenda-files (mapcan
                    'tra:get-metatype-org-files
                    tra:actionable-metatypes))
        (setq org-agenda-text-search-extra-files (mapcan
                                     'tra:get-metatype-org-files
                                     tra:non-actionable-metatypes)))
   #+END_SRC
   #+BEGIN_SRC emacs-lisp
      (message "loading rebuild function")
      (defun rebuild-agenda-files ()
        (interactive)
        (org-save-all-org-buffers)
        (tra:build-org-agenda-files)
        (setq tra:all-org-files ( append
                                  org-agenda-files
                                  org-agenda-text-search-extra-files)
              )
        )
   #+END_SRC


** Refile targets
   Make it fast to refile either an action or a reference by making them two
   different functions
   #+BEGIN_SRC emacs-lisp
     (defun org-refile-actionable-items ()
       "set the refile targets to files that contain actions"
       (interactive)
       (setq org-refile-targets ())
       (setq org-refile-targets '((org-agenda-files :maxlevel . 5)))
       (setq org-refile-use-outline-path 'file)
       (setq org-outline-path-complete-in-steps nil)
       (setq org-refile-allow-creating-parent-nodes 'confirm)
       (org-refile)
     )
   #+END_SRC
   #+BEGIN_SRC emacs-lisp
     (defun org-refile-reference-items ()
       "set the refile targets to files that contain reference"
       (interactive)
       (setq org-refile-targets ())
       (setq org-refile-targets '((org-agenda-text-search-extra-files :maxlevel . 5)))
       (setq org-refile-use-outline-path 'file)
       (setq org-outline-path-complete-in-steps nil)
       (setq org-refile-allow-creating-parent-nodes 'confirm)
       (org-refile)
     )
   #+END_SRC


** Source cleanup after tangle
   After tangling a file, indent the code
   #+BEGIN_SRC emacs-lisp
     (defun tra/source-cleanup ()
       (indent-region (point-min) (point-max))
       (save-buffer)
     )

     (add-hook 'org-babel-post-tangle-hook 'tra/source-cleanup)
   #+END_SRC
** Save org buffers often
   I dont want to lose any info from org mode, and when I refile, a lot of org
   buffers end up open.  This saves them at regular intervals.
   2021-01-27 I'm disabling this because it messes with me when I try to type in
   an org mode file.  It drops any whitespace which makes typing weird.  And I
   think it might be causing a crash?
   #+BEGIN_SRC emacs-lisp :tangle no
   ;;(add-hook 'auto-save-hook 'org-save-all-org-buffers)
   #+END_SRC

** Capture from the command line or from org-protocol
   I want the capture from external programs to close the frame after it is done

   #+BEGIN_SRC emacs-lisp
       (add-hook 'org-capture-mode-hook 'delete-other-windows)

     (defadvice org-capture-finalize (after delete-capture-frame activate)
       "Advise capture-finalize to close the frame if it is the capture frame"
       (if (equal "capture" (frame-parameter nil 'name))
           (delete-frame)))

     (defadvice org-capture-destroy
         (after delete-capture-frame activate)
       "Advise capture-destroy to close the frame"
       (if (equal "capture" (frame-parameter nil 'name))
           (delete-frame)))

     (defun make-capture-frame ()
       "Create a new frame and run org-capture"
       (interactive)
       (make-frame-on-display ":0" '((name . "capture")
                     (width . 120)
                     (height . 20)))
       (select-frame-by-name "capture")
       (org-capture nil "o")
       )

   #+END_SRC
