link/.spacemacs.d/init.el
  (setq c-basic-offset 4)
  (defconst my-c-style
    '((c-tab-always-indent        . t)
      (c-comment-only-line-offset . 0)
      (c-hanging-braces-alist     . ((substatement-open after)
                                     (brace-list-open)))
      (c-hanging-colons-alist     . ((member-init-intro before)
                                     (inher-intro)
                                     (case-label after)
                                     (label after)
                                     (access-label after)))
      (c-cleanup-list             . (scope-operator
                                     empty-defun-braces
                                     defun-close-semi))
      (c-offsets-alist            . ((arglist-close . c-lineup-arglist)
                                     (substatement-open . 0)
                                     (case-label        . 4)
                                     (block-open        . 0)
                                     (namespace-open    . 0)
                                     (innamespace       . 0)
                                     (knr-argdecl-intro . -)))
      (c-echo-syntactic-information-p . t)
      )
    "My C Programming Style")

  ;; offset customizations not in my-c-style
  (setq c-offsets-alist '((member-init-intro . ++)))

  ;; Customizations for all modes in CC Mode.
  (defun my-c-mode-common-hook ()
    ;; add my personal style and set it for the current buffer
    (c-add-style "PERSONAL" my-c-style t)
    ;; other customizations
    (setq tab-width 4
          ;; this will make sure spaces are used instead of tabs
          indent-tabs-mode nil)
    ;; we like auto-newline and hungry-delete
    (c-toggle-auto-hungry-state 1)
    )
  (add-hook 'c-mode-common-hook 'my-c-mode-common-hook)
  (add-hook 'c++-mode-hook 'my-c-mode-common-hook)
  (setq org-plantuml-jar-path "/usr/share/plantuml/plantuml.jar")
  (setq treemacs-use-follow-mode 'tag
        treemacs-use-filewatch-mode t
        treemacs-use-git-mode 'deferred
        treemacs-use-all-the-icons-theme t)
  (setq deft-use-filename-as-title t)
  ;; with this tell deft to use the search
  ;; term as the filename if a new file is created
  (setq deft-use-filter-string-for-filename t)
  (setq deft-file-naming-rules
        '((noslash . "-")
          (nospace . "-")
          (case-fn . downcase)))
  (setq deft-text-mode 'org-mode)
  (setq deft-org-mode-title-prefix t)
  (setq deft-directory org-directory)
  (setq deft-archive-directory "../.archive/")
  (setq deft-extensions '("org"))
  (setq deft-default-extension "org")
  (setq deft-auto-save-interval 30)
  (require 'calfw)
  (require 'calfw-org)
  (setq calendar-week-start-day 1) ;; monday
  (add-to-list 'load-path "~/.spacemacs.d/external/remind-mode.el")
  (add-to-list 'auto-mode-alist '("\\.rem\\'" . remind-mode))
  (spacemacs/declare-prefix "o" "custom")
  (spacemacs/set-leader-keys "og" 'gtd)
  (spacemacs/set-leader-keys "od" 'deft)
  (spacemacs/declare-prefix-for-mode 'org-mode "mo" "custom")
  (spacemacs/set-leader-keys-for-major-mode 'org-mode "oi" 'org-id-get-create)
  (spacemacs/set-leader-keys-for-major-mode 'org-mode "ort" 'tra:refile-actionable-items)
  (spacemacs/set-leader-keys-for-major-mode 'org-mode "orr" 'tra:refile-reference-items)
  (spacemacs/set-leader-keys-for-major-mode 'org-mode "ors" 'tra:refile-reference-items)
  (rebuild-agenda-files)
  )
(defun review ()
  (interactive)
  (find-file org-default-inbox-file)
  )
(defun gtd ()
  (interactive)
  (find-file org-default-inbox-file)
  )
(defun tra:get-metatype-org-files (metatype &optional other-directory)
  (let ((my-org-directory (or other-directory org-directory "~/org")))
    (f-files my-org-directory (lambda (file)
                                (s-matches?
                                 (cdr (assoc metatype tra:org-file-metatypes)) (f-filename file) )
                                ))))
(defun tra:build-org-agenda-files ()
  (setq org-agenda-files (mapcan
                          'tra:get-metatype-org-files
                          tra:actionable-metatypes))
  (setq org-agenda-text-search-extra-files (mapcan
                                            'tra:get-metatype-org-files
                                            tra:non-actionable-metatypes)))
(message "loading rebuild function")
(defun rebuild-agenda-files ()
  (interactive)
  (org-save-all-org-buffers)
  (tra:build-org-agenda-files)
  (setq tra:all-org-files ( append
                            org-agenda-files
                            org-agenda-text-search-extra-files)
        )
  )
(defun org-refile-actionable-items ()
  "set the refile targets to files that contain actions"
  (interactive)
  (setq org-refile-targets ())
  (setq org-refile-targets '((org-agenda-files :maxlevel . 5)))
  (setq org-refile-use-outline-path 'file)
  (setq org-outline-path-complete-in-steps nil)
  (setq org-refile-allow-creating-parent-nodes 'confirm)
  (org-refile)
  )
(defun org-refile-reference-items ()
  "set the refile targets to files that contain reference"
  (interactive)
  (setq org-refile-targets ())
  (setq org-refile-targets '((org-agenda-text-search-extra-files :maxlevel . 5)))
  (setq org-refile-use-outline-path 'file)
  (setq org-outline-path-complete-in-steps nil)
  (setq org-refile-allow-creating-parent-nodes 'confirm)
  (org-refile)
  )
(defun tra/source-cleanup ()
  (indent-region (point-min) (point-max))
  (save-buffer)
  )

(add-hook 'org-babel-post-tangle-hook 'tra/source-cleanup)
(add-hook 'org-capture-mode-hook 'delete-other-windows)

(defadvice org-capture-finalize (after delete-capture-frame activate)
  "Advise capture-finalize to close the frame if it is the capture frame"
  (if (equal "capture" (frame-parameter nil 'name))
      (delete-frame)))

(defadvice org-capture-destroy
    (after delete-capture-frame activate)
  "Advise capture-destroy to close the frame"
  (if (equal "capture" (frame-parameter nil 'name))
      (delete-frame)))

(defun make-capture-frame ()
  "Create a new frame and run org-capture"
  (interactive)
  (make-frame-on-display ":0" '((name . "capture")
                                (width . 120)
                                (height . 20)))
  (select-frame-by-name "capture")
  (org-capture nil "o")
  )
