link/.spacemacs.d/init.el
(defun archive-org-file ()
  (interactive)
  (let ((filename (buffer-file-name)))
    (let ((current-buffer (buffer-name))))
    (if (not (and filename (file-exists-p filename)))
        (message "Buffer %s is not visiting a file" filename)
      (let
          ((new-name
            (concat
             "/home/aldrichtr/org/.archive/"
             (file-name-sans-extension filename)
             "-"
             (format-time-string "%Y%m%d" (current-time))
             ".org_archive"
             ))
           )
        )
      (rename-file filename new-name 1) ;; if the file exists, ask before writing
      (kill-buffer current-buffer)
      (message "File %s successfully archived to %s" filename (file-name-nondirectory new-name))
      )))
(defun make-deft-frame ()
  "Create a new frame and run deft"
  (interactive)
  (make-frame-on-display ":0"
                         '((name . "deft")
                           (width . 120)
                           (height . 20)))
  (select-frame-by-name "deft")
  (deft))
(defun print-narrowed-project ()
  (interactive)
  (org-tree-to-indirect-buffer)
  (set-buffer org-last-indirect-buffer)
  (setq ps-number-of-columns 1)
  (setq ps-landscape-mode nil)
  (setq ps-paper-type 'statement)
  (setq ps-top-margin 63)
  (setq ps-bottom-margin 36)
  (setq ps-left-margin 18)
  (setq ps-right-margin 18)
  (setq ps-zebra-stripes t)
  (setq ps-zebra-stripe-height 1)
  (setq ps-print-header nil)
  (setq ps-print-footer nil)
  (setq ps-print-n-of-n nil)
  (ps-spool-buffer)
  (set-buffer "*PostScript*")
  (write-file (concat "~/paperPlanner/Agenda-Export/" (buffer-name org-last-indirect-buffer) ".ps"))
  )

(defun print-buffer-as-planner-page ()
  (interactive)
  (setq ps-number-of-columns 1)
  (setq ps-landscape-mode nil)
  (setq ps-paper-type 'statement)
  (setq ps-top-margin 63)
  (setq ps-bottom-margin 36)
  (setq ps-left-margin 18)
  (setq ps-right-margin 18)
  (setq ps-zebra-stripes t)
  (setq ps-zebra-stripe-height 1)
  (setq ps-print-header nil)
  (setq ps-print-footer nil)
  (setq ps-print-n-of-n nil)
  (ps-spool-buffer)
  (set-buffer "*PostScript*")
  (write-file (concat "~/paperPlanner/Agenda-Export/" (buffer-name org-last-indirect-buffer) ".ps"))
  )
(defun djcb-popup (title msg &optional icon sound)
  "Show a popup if we're on X, or echo it otherwise; TITLE is the title
of the message, MSG is the context. Optionally, you can provide an ICON and
a sound to be played"

  (interactive)
  (when sound (shell-command
               (concat "cvlc --play-and-exit " sound " 2> /dev/null")))
  (if (eq window-system 'x)
      (shell-command (concat "notify-send "
                             "-t 300000 "
                             (if icon (concat "-i " icon) "")
                             " '" title "' '" msg "'"))
    ;; text only version

    (message (concat title ": " msg))))


(defun djcb-appt-display (min-to-app new-time msg)

  (djcb-popup (format "Appointment in %s minute(s)" min-to-app) msg
              "/usr/share/icons/Papirus-Dark/48x48/status/task-due.svg"

              "/usr/share/sounds/freedesktop/stereo/phone-incoming-call.oga"))
(setq appt-disp-window-function (function djcb-appt-display))
(defun org-time-to-minutes (time)
  "Convert an HHMM time to minutes"
  (+ (* (/ time 100) 60) (% time 100)))

(defun org-time-from-minutes (minutes)
  "Convert a number of minutes to an HHMM time"
  (+ (* (/ minutes 60) 100) (% minutes 60)))

(defadvice org-agenda-add-time-grid-maybe (around mde-org-agenda-grid-tweakify
                                                  (list ndays todayp))
  (if (member 'remove-match (car org-agenda-time-grid))
      (flet ((extract-window
              (line)
              (let ((start (get-text-property 1 'time-of-day line))
                    (dur (get-text-property 1 'duration line)))
                (cond
                 ((and start dur)
                  (cons start
                        (org-time-from-minutes
                         (truncate
                          (+ dur (org-time-to-minutes start))))))
                 (start start)
                 (t nil)))))
        (let* ((windows (delq nil (mapcar 'extract-window list)))
               (org-agenda-time-grid
                (list
                 (car org-agenda-time-grid)
                 (remove-if
                  (lambda (time)
                    (find-if (lambda (w)
                               (if (numberp w)
                                   (equal w time)
                                 (and (>= time (car w))
                                      (< time (cdr w)))))
                             windows))
                  (cadr org-agenda-time-grid) )
                 (caddr org-agenda-time-grid)
                 (cadddr org-agenda-time-grid)
                 )))
          ad-do-it))
    ad-do-it))
(ad-activate 'org-agenda-add-time-grid-maybe)
;; > Do not write anything past this comment. This is where Emacs will
;; > auto-generate custom variable definitions.
;; yeah, i know what you said but... i hate the extra cruft in here

(setq custom-file "~/.spacemacs.d/emacs-customs.el")
(load custom-file)
